app/controllers/tasks_controller.rb

SELECT  "tasks".* FROM "tasks" WHERE "tasks"."user_id" = $1 ORDER BY "tasks"."state" DESC, "tasks"."limit_date" ASC LIMIT $2  [["user_id", 1], ["LIMIT", 11]]
---
  def index
    @task = Task.new
    @tasks  = current_user.tasks.order(state: "DESC").order(limit_date: "ASC")

INSERT INTO "tasks" ("state", "task", "limit_date", "created_at", "updated_at", "description", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["state", "対応中"], ["task", "test"], ["limit_date", "2021-01-23"], ["created_at", "2021-01-23 11:48:27.197897"], ["updated_at", "2021-01-23 11:48:27.197897"], ["description", ""], ["user_id", 1]]
---
  def create
    @task = current_user.tasks.new task_params
    @task.save!

SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]
---
  def show
    id      = params[:id]
    @task   = Task.find(id)

SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 13], ["LIMIT", 1]]
UPDATE "tasks" SET "task" = $1, "state" = $2, "limit_date" = $3, "description" = $4, "updated_at" = $5 WHERE "tasks"."id" = $6
---
    task = Task.find(params[:id])
    task.task         = params[:task]
    task.state        = params[:state]
    task.limit_date   = params[:limit_date]
    task.description  = params[:description]
    task.save

SELECT  "tasks".* FROM "tasks" WHERE "tasks"."user_id" = $1 AND "tasks"."id" = $2 LIMIT $3  [["user_id", 1], ["id", 12], ["LIMIT", 1]]
---
  def target_task task_id
    current_user.tasks.where(id: task_id).take