app/controllers/tasks_controller.rb

INSERT INTO "tasks" ("state", "task", "limit_date", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["state", "新規"], ["task", "睡眠"], ["limit_date", "2021-01-01"], ["created_at", "2021-01-20 11:23:14.768255"], ["updated_at", "2021-01-20 11:23:14.768255"], ["user_id", 1]]
---
      task = Task.new
      task.task       = params[:task]
      task.state      = params[:state]
      task.limit_date = params[:limit_date]
      task.save